[
  {
    "id": "resume_20250411_210624",
    "filename": "resume_20250411_210624.pdf",
    "path": "/Users/padraigobrien/Desktop/CareeroOS/backend/uploads/resume_20250411_210624.pdf",
    "upload_date": "2023-01-01T12:00:00",
    "text": "Sample resume text with experience in software development and data analysis.",
    "skills": [
      "Python",
      "JavaScript",
      "React",
      "Node.js",
      "Machine Learning"
    ],
    "education": [
      {
        "degree": "BS Computer Science",
        "institution": "University of Technology",
        "year": "2020"
      }
    ],
    "experience": [
      {
        "title": "Software Engineer",
        "company": "Tech Solutions Inc.",
        "duration": "2020-2022",
        "description": "Developed web applications using React and Node.js"
      },
      {
        "title": "Data Analyst",
        "company": "Data Insights Co.",
        "duration": "2022-Present",
        "description": "Performed data analysis and built machine learning models"
      }
    ]
  },
  {
    "id": "resume_20250414222724",
    "filename": "resume_20250414222724.pdf",
    "path": "uploads/resume_20250414222724.pdf",
    "upload_date": "2025-04-14T22:27:24.164184",
    "text": "Padraig O’Brien, Data Scientist\nCork, Ireland, +353,85 1756825, Padraigobrien00@gmail.com\nLINKS Linkedin, Github\nPROFILE Data Scientist and technical lead with a proven track record of independently driving end-to-end\ndata science projects. Adept at conceptualising, developing, and deploying production-level ML\nsolutions—from an outlier detection model that underpinned securing our largest customer under intense\ntime pressures to pioneering a computer vision system for quality control. Skilled in simulating and\nrigorously testing models, effectively communicating actionable insights to senior stakeholders, and\nmentoring emerging talent. Brings full-stack expertise in data collection, aggregation, analysis, and\nproduction developed through academic, personal, and industry projects, with a strong product sensibility\nthat consistently delivers business impact.\n\nEMPLOYMENT HISTORY\nSep 2023 — Present Data Scientist, yieldHUB Limerick\n• Developed an AI-driven solution for detecting and measuring voiding in X-ray microchip images,\nleveraging classification algorithms, advanced linear algebra, computer vision techniques, and\nanomaly detection for high-precision analysis.\n• Spearheaded a production-level outlier detection model - developing algorithms from scratch under\nintense time pressure - to revolutionise our platform and secure our largest client.\n• Led full-stack development of an innovative computer vision processor, establishing an industry-first\npass/fail system powered by a complex path-finding algorithm to enhance quality control processes.\n• As project lead, developed custom statistical scripts leveraging our API to tailor solutions to customer\nrequirements, ensuring scalable, efficient, and client-centric implementations.\n• Collaborated extensively with cross-functional engineering teams to align on project goals,\ndemonstrating strong communication and effective stakeholder engagement.\n• Built a data ingestion pipeline to transform complex image and manufacturing data, further securing\na major client and showcasing advanced data wrangling and pipeline development skills.\n• Consulted on image processor redevelopment using Rust, enhancing system performance and\noptimising code efficiency.\n• Provided expertise in statistical analysis by refining ANOV A applications to align with client\nevaluation criteria and improve decision accuracy.\n• Actively mentored a data science intern and consulted company-wide on ML/AI and statistical\ntechniques, elevating team capabilities and fostering a culture of continuous learning.\n• Delivered impactful presentations on deep learning and large language models (LLMs), reinforcing\na scientific mindset across teams.\nMar 2022 — Aug 2022 Data Engineering Intern, Groupon Remote\n• Designed and implemented multiple Python and SQL applications—including a data transfer\ninterface, an automated data backup service, and a chatbot—to streamline and optimise data\nworkflows. Successfully deployed the data transfer interface to customers, receiving positive\nfeedback for both performance and user-friendly design.\n• Gained hands-on experience with Google Cloud, Hadoop and Airflow, leveraging these Big Data\ntools to enhance data processing efficiency and manage large-scale, complex workflows.\n• Built a strong foundation in handling extensive datasets through robust data wrangling and\nindustry-standard practices, demonstrating advanced programming skills and delivering scalable\nsolutions for data-intensive environments.\nMar 2020 — Feb 2022 Engineering Contractor, Cognex Cork\n• Managed and redeveloped product testing systems, overseeing component procurement, network\nconfiguration, and 19” rack setup to improve functionality and operational efficiency. Applied\nstrategic project management to streamline testing processes, significantly enhancing system\nperformance.\n• Designed and maintained data-driven information portals for operators, centralising critical\nresources like quality alerts, instructions, and error procedures to reduce operator errors and increase\ndistribution centre efficiency.\n• Leveraged portals as training tools to standardise and expedite on-boarding, resulting in improved\nproductivity and streamlined knowledge transfer across teams.\n\nEDUCATION\nSep 2019 — May 2023 BSc Data Science And Analytics, University College Cork\n• Bachelor of Science in Data Science and Analytics from University College Cork (UCC), graduating\nwith a 2.1 average. Developed expertise in Python, R, Java, and SQL, enabling proficiency in\nbuilding machine learning solutions, data wrangling, and model deployment.\n• Applied advanced machine learning techniques, including ensemble learning, hyper-parameter\ntuning, and feature engineering, to derive actionable insights from complex datasets.\n• Academic training included dimensionality reduction (PCA) and advanced statistical methods like\nBayesian Inference, Hypothesis Testing, and Monte Carlo Simulations, as well as data engineering\nfoundations in data ingestion, ETL, and Big Data frameworks.\n• Developed strong skills in cluster analysis, multivariate regression, and cross-validation techniques\nto ensure model robustness, equipping me to deliver reliable data-driven solutions.\n• Experienced in data visualisation and statistical modelling , enabling effective data storytelling and\ninsights communication to stakeholders.\nACADEMIC PROJECTS Final Year Data Analytics Project\n• Led an in-depth analytics project on the impact of Covid-19 on home advantage in soccer, achieving\na 1.1 grade. Conducted comprehensive data scraping, extensive data preprocessing, and rigorous\ncross-validation to build robust datasets.\n• Applied advanced statistical modelling to quantify factors influencing home advantage, analysing\ntheir significance across the pandemic timeline to uncover shifts in game dynamics and deliver\nactionable insights.\n• Utilised multiple regression analysis to assess relationships between game factors and performance\noutcomes, ensuring a comprehensive, data-driven evaluation that highlighted key trends.\nMultivariate Analysis\n• Achieved a 1.1 grade on assignments implementing multivariate analyses, including Principal\nComponent Analysis (PCA), linear and quadratic discriminant analysis, and hierarchical clustering,\nalong with other advanced statistical methods.\n• Processed and analysed extensive datasets, some with over 700 million data points, showcasing\nproficiency in handling high-dimensional data and deriving meaningful insights.\nAlgorithms & Data Structures\n• Achieved a 100% grade by replicating Dijkstra's path-finding algorithm on a dataset exceeding\n500,000 data points, successfully optimising it under stringent time constraints to reduce the run\ntime from minutes to under one second.\n• Later adapted the optimised algorithm in the workplace by incorporating zero cost nodes, delivering\na creative and innovative solution to a persistent challenge in our computer vision project, displaying\na clear algorithmic understanding and demonstrated my capacity to translate theoretical concepts\ninto practical, high-impact solutions.\nPERSONAL PROJECTS Healthcare Appointment No-Show Predictor\n• Developed a high-accuracy machine learning model to predict patient no-shows, achieving up to\n90% accuracy through classification algorithms such as logistic regression, SVMs, random forests,\nand gradient boosting. Enhanced data preprocessing with advanced feature engineering and managed\nimbalanced datasets to ensure model robustness.\n• Applied cross-validation techniques to validate reliability and optimise model performance,\ndelivering actionable insights that improved scheduling efficiency and informed operational\nplanning for healthcare providers. This project demonstrated the impact of data-driven\ndecision-making on critical process improvements.\nDynamic Car Price Prediction Model\n• Engineered a car price prediction model using advanced regression techniques, including Lasso,\nRidge, and Gradient Boosted Regression, to deliver accurate market-based pricing assessments.\nEnhanced model precision by 12% through comprehensive data preprocessing, incorporating EDA,\none-hot encoding, and strategic feature selection.\n• Generated actionable insights that underscored the model’s value in facilitating data-driven\ndecision-making, demonstrating strong skills in data wrangling, analytics, and model refinement.",
    "skills": [
      "in data collection",
      "aggregation",
      "analysis",
      "and",
      "production developed through academic",
      "personal",
      "and industry projects",
      "with a strong product sensibility",
      "that consistently delivers business impact."
    ],
    "education": [
      {
        "degree": "Sep 2019 — May 2023 BSc Data Science And Analytics",
        "institution": "University College Cork",
        "year": "2019"
      }
    ],
    "experience": [
      {
        "title": "HISTORY",
        "company": "Unknown",
        "duration": "Unknown",
        "description": "HISTORY"
      },
      {
        "title": "Sep 2023 — Present Data Scientist",
        "company": "yieldHUB Limerick",
        "duration": "Unknown",
        "description": "Sep 2023 — Present Data Scientist, yieldHUB Limerick\n• Developed an AI-driven solution for detecting and measuring voiding in X-ray microchip images,\nleveraging classification algorithms, advanced linear algebra, computer vision techniques, and\nanomaly detection for high-precision analysis.\n• Spearheaded a production-level outlier detection model - developing algorithms from scratch under\nintense time pressure - to revolutionise our platform and secure our largest client.\n• Led full-stack development of an innovative computer vision processor, establishing an industry-first\npass/fail system powered by a complex path-finding algorithm to enhance quality control processes.\n• As project lead, developed custom statistical scripts leveraging our API to tailor solutions to customer\nrequirements, ensuring scalable, efficient, and client-centric implementations.\n• Collaborated extensively with cross-functional engineering teams to align on project goals,\ndemonstrating strong communication and effective stakeholder engagement.\n• Built a data ingestion pipeline to transform complex image and manufacturing data, further securing\na major client and showcasing advanced data wrangling and pipeline development skills.\n• Consulted on image processor redevelopment using Rust, enhancing system performance and\noptimising code efficiency.\n• Provided expertise in statistical analysis by refining ANOV A applications to align with client\nevaluation criteria and improve decision accuracy.\n• Actively mentored a data science intern and consulted company-wide on ML/AI and statistical\ntechniques, elevating team capabilities and fostering a culture of continuous learning.\n• Delivered impactful presentations on deep learning and large language models (LLMs), reinforcing\na scientific mindset across teams."
      },
      {
        "title": "Mar 2022 — Aug 2022 Data Engineering Intern",
        "company": "Groupon Remote",
        "duration": "Unknown",
        "description": "Mar 2022 — Aug 2022 Data Engineering Intern, Groupon Remote\n• Designed and implemented multiple Python and SQL applications—including a data transfer\ninterface, an automated data backup service, and a chatbot—to streamline and optimise data\nworkflows. Successfully deployed the data transfer interface to customers, receiving positive\nfeedback for both performance and user-friendly design.\n• Gained hands-on experience with Google Cloud, Hadoop and Airflow, leveraging these Big Data\ntools to enhance data processing efficiency and manage large-scale, complex workflows.\n• Built a strong foundation in handling extensive datasets through robust data wrangling and\nindustry-standard practices, demonstrating advanced programming skills and delivering scalable\nsolutions for data-intensive environments."
      },
      {
        "title": "Mar 2020 — Feb 2022 Engineering Contractor",
        "company": "Cognex Cork",
        "duration": "Unknown",
        "description": "Mar 2020 — Feb 2022 Engineering Contractor, Cognex Cork\n• Managed and redeveloped product testing systems, overseeing component procurement, network\nconfiguration, and 19” rack setup to improve functionality and operational efficiency. Applied\nstrategic project management to streamline testing processes, significantly enhancing system\nperformance.\n• Designed and maintained data-driven information portals for operators, centralising critical\nresources like quality alerts, instructions, and error procedures to reduce operator errors and increase\ndistribution centre efficiency.\n• Leveraged portals as training tools to standardise and expedite on-boarding, resulting in improved\nproductivity and streamlined knowledge transfer across teams."
      }
    ]
  }
]